import pandas as pd
import numpy as np

'''
是什么原因造成2020年5月的销售业绩同比减少了11.6%？
我们都知道销售额=用户数×客单价，而销售额减少，可能存在的情况就是客单价降低了或者用户数减少了。
而客单价则与产品销售结构有关，用户数又与新用户和老用户的转化率相关。
'''

t1_1 = pd.read_excel("../data/c8/2销售业绩分析.xlsx", sheet_name="订单表")
t1_2 = pd.read_excel("../data/c8/2销售业绩分析.xlsx", sheet_name="任务下发表")

t1_1['日期'] = pd.to_datetime(t1_1['日期'])

t2 = t1_1[t1_1['日期'].dt.month == 5]
t2['年月'] = t2['日期'].dt.strftime("%Y-%m")

print(t2)

'''
1. 客单价分析
'''
t3 = t2.groupby("年月").agg({"实付金额":"sum", "用户id":"nunique"}).rename(columns={"实付金额":"销售额", "用户id":"用户数"})

t3['客单价'] = round(t3['销售额'] / t3['用户数'])

print(t3)

'''
用户数与去年同期持平，客单价则下降了11.5%。原来问题出在了客单价上面。
'''

'''
2. 不同产品的客单价
'''
t3 = t2.groupby(by=['年月', '产品名称']).agg({"实付金额":"sum", "用户id":"nunique"}).rename(columns={"实付金额":"销售额", "用户id":"用户数"}).reset_index()

t3['客单价'] = round(t3['销售额'] / t3['用户数'])

print(t3)

'''
可以发现，域名、云存储、云服务器产品的客单价均有不同程度的增长，但数据库产品的客单价却同比降低了32.1%，原来问题是出在了数据库产品上。
'''

'''
3.0
'''